Q-1. Write an SQL query to print the FIRST_NAME from Worker table after replacing ‘a’ with ‘A’.

In [1]:
import mysql.connector
from mysql.connector import Error

try:
    connection = mysql.connector.connect(host='localhost',
                                         user='root',
                                         password='Am!t@kmr_2$@2')

except Error as e:
    print("Error while connecting to MySQL", e)

In [2]:
if connection.is_connected():
        db_Info = connection.get_server_info()
        print("Connected to MySQL Server version ", db_Info)
        cursor = connection.cursor()
        #cursor.execute("create database workdatabase;")
        #cursor.execute("use workdatabase;")
        print("You're connected to database: ")

Connected to MySQL Server version  8.0.28
You're connected to database:

In [3]:
cursor.execute ("use workdatabase")

In [4]:
cursor.execute("select REPLACE(ename,'a','A') as WORKER_NAME from emp;")

In [5]:
cursor.fetchall()

[('SMITH',),
 ('ALLEN',),
 ('WARD',),
 ('JONES',),
 ('MARTIN',),
 ('BLAKE',),
 ('CLARK',),
 ('SCOTT',),
 ('KING',),
 ('TURNER',),
 ('ADAMS',),
 ('JAMES',),
 ('FORD',),
 ('MILLER',)]

Q-2. Write an SQL query to print all Worker details from the Worker table order by FIRST_NAME Ascending and DEPARTMENT Descending.

In [6]:
cursor.execute("select * from emp order by ename asc, deptno desc;")

In [7]:
cursor.fetchall()

[(7876,
  'ADAMS',
  'CLERK',
  7788,
  datetime.date(1999, 6, 4),
  Decimal('1100.00'),
  None,
  20),
 (7499,
  'ALLEN',
  'SALESMAN',
  7698,
  datetime.date(1998, 8, 15),
  Decimal('1600.00'),
  Decimal('300.00'),
  30),
 (7698,
  'BLAKE',
  'MANAGER',
  7839,
  datetime.date(1992, 6, 11),
  Decimal('2850.00'),
  None,
  30),
 (7782,
  'CLARK',
  'MANAGER',
  7839,
  datetime.date(1993, 5, 14),
  Decimal('2450.00'),
  None,
  10),
 (7902,
  'FORD',
  'ANALYST',
  7566,
  datetime.date(1997, 12, 5),
  Decimal('3000.00'),
  None,
  20),
 (7900,
  'JAMES',
  'CLERK',
  7698,
  datetime.date(2000, 6, 23),
  Decimal('950.00'),
  None,
  30),
 (7566,
  'JONES',
  'MANAGER',
  7839,
  datetime.date(1995, 10, 31),
  Decimal('2975.00'),
  None,
  20),
 (7839,
  'KING',
  'PRESIDENT',
  None,
  datetime.date(1990, 6, 9),
  Decimal('5000.00'),
  Decimal('0.00'),
  10),
 (7654,
  'MARTIN',
  'SALESMAN',
  7698,
  datetime.date(1998, 12, 5),
  Decimal('1250.00'),
  Decimal('1400.00'),
  30),
 (7934,
  'MILLER',
  'CLERK',
  7782,
  datetime.date(2000, 1, 21),
  Decimal('1300.00'),
  None,
  10),
 (7788,
  'SCOTT',
  'ANALYST',
  7566,
  datetime.date(1996, 3, 5),
  Decimal('3000.00'),
  None,
  20),
 (7369,
  'SMITH',
  'CLERK',
  7902,
  datetime.date(1993, 6, 13),
  Decimal('800.00'),
  Decimal('0.00'),
  20),
 (7844,
  'TURNER',
  'SALESMAN',
  7698,
  datetime.date(1995, 6, 4),
  Decimal('1500.00'),
  Decimal('0.00'),
  30),
 (7521,
  'WARD',
  'SALESMAN',
  7698,
  datetime.date(1996, 3, 26),
  Decimal('1250.00'),
  Decimal('500.00'),
  30)]

Q-3. Write an SQL query to fetch the names of workers who earn the highest salary.

In [8]:
cursor.execute("select ename,sal from emp where sal=(select max(sal) from emp);")

In [9]:
cursor.fetchall()

[('KING', Decimal('5000.00'))]

In [10]:
cursor.close()
connection.close()
print("MySQL connection is closed")

MySQL connection is closed